Courses/4420/Lectures/LinuxSetup/Passwords/Word-Lists/passwords-good.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Choosing Good Passwords</title>
<!-- 2017-03-05 Sun 23:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Mateti: Android Internals and Security"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Choosing Good Passwords</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Choosing Good Passwords</a>
<ul>
<li><a href="#sec-1-1">1.1. DOs and DONTs</a></li>
<li><a href="#sec-1-2">1.2. Bad Common Practices</a></li>
</ul>
</li>
<li><a href="#sec-2">2. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Choosing Good Passwords</h2>
<div class="outline-text-2" id="text-1">
<p>
The goal is to make password cracking difficult.
</p>

<p>
1997.01.02, PA News: "A recent survey by Compaq in the financial
district of London showed that poor choices are the norm for computer
passwords there. A staggering 82% of the respondents said they used,
in order of preference, "a sexual position or abusive name for the
boss" (30%), their partner's name or nickname (16%), the name of their
favorite holiday destination (15%), sports team or player (13%), and
whatever they saw first on their desk (8%)."
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> DOs and DONTs</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Don't</b> use the following for passwords: Your first name.  Your last
name. Your login name. Your pet's name.  Names and birth dates of
spouses, friends, relatives and friends.  Any name at all. SS
number. House number. Telephone number. Your bank PIN.  Any password
shorter than six characters.
</p>

<p>
<b>Don't</b> use the same password for all your accounts.  An attacker who
broke into one account usually discovers these other accounts by going
through the memoranda that the user keeps in his files as well as by
running keystroke loggers or simple sniffers.
</p>


<p>
<b>Do</b> use passwords of six characters or more.  Use a combination of
letters, numbers, and special characters. E.g., the following advice
is found on the web.
</p>


<ol class="org-ol">
<li>Think of a memorable phrase, such as "over the hills and far away,
to grand mothers house we go."
</li>

<li>Next, turn it into an acronym (including the punctuation): <code>othafa,tgmhwg.</code>
</li>

<li>Add complexity by substituting numbers and symbols for letters in
the acronym. For example, substitute 0 for o, 3 for e, 7 for t and
the at symbol (@) for a: <code>07h@f@,7gmhwg.</code>
</li>

<li>Add more complexity by capitalizing at least one letter,
such as H. <code>07H@f@,7gmHwg</code>.
</li>

<li>Finally, do not use the example password above.
</li>
</ol>


<p>
Of course, we must be aware of password cracking/stealing procedures
in choosing passwords.
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Bad Common Practices</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Most passwords are typed by real humans in real time.  It is
unreasonable to expect that people will choose either long passwords
("pass phrases") or difficult passwords.  Any requirement that
ultimately causes people to write passwords down on paper or in a file
defeats it.
</p>

<p>
This obvious point is lost on most system administrators and auditors.
E.g., consider the following guidelines:
</p>

<p>
"In addition to the password requirements below, please also remember
that your password is case sensitive and you should always change your
stored password on any mobile devices you use.
</p>

<ol class="org-ol">
<li>The password length must be 8 to 14 
</li>
<li>The password must contain a letter.
</li>
<li>The password must contain at least one of these special characters:0123456789<sup>()</sup>&#x2013;!$
</li>
<li>Do NOT use names or common words in the dictionary.
</li>
<li>Do NOT use the following symbols %#.@
</li>
<li>Do NOT use the last four digits of your SSN.
</li>
<li>Do NOT use your CAMPUS Account username, your first name, or your last name.
</li>
<li>Do NOT use 3 or more repeated (i.e., aaa or 111) or consecutive (i.e., abc or 123) characters.
</li>
</ol>

<p>
Frequently, the recycling of previously used passwords is forbidden.
This implies that the old passwords are stored somewhere.  If and when
that system is intruded, not only the current passwords but all the
old passwords are revealed.  We must realize that many users use the
same passwords on multiple systems.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> End</h2>
<div class="outline-text-2" id="text-2">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-02-06
</div>
</body>
</html>
